[
  {
    "Title": "45 Pieces Of Merch Tied To The \"Barbie\" Movie That I'm Honestly Low-Key Obsessed With",
    "Description": "Barbie collaborated with everyone. And Ken is just Ken."
  },
  {
    "Title": "Margot Robbie Just Paid Tribute To The Original Barbie From 1959 With Another Flawless Press Tour Look",
    "Description": "Margot Robbie's Barbie press tour looks have been so good, and her latest one referenced the original Barbie doll."
  },
  {
    "Title": "Margot Robbie Said That \"Barbie\" Wouldn't Exist If Patty Jenkins Hadn't Directed \"Wonder Woman\"",
    "Description": "Released in 2017, Wonder Woman was not only the first female-led superhero film in more than a decade — it was the first to be directed by a woman, and according to Margot Robbie, it paved the way."
  },
  {
    "Title": "\"This Movie Feels Important To Me On So Many Levels\": America Ferrera Broke Down Exactly Why \"Barbie\" Will Hit Home For People Of Colour",
    "Description": "This movie is going to have me laughing and weeping in the cinema."
  },
  {
    "Title": "\"Barbie\" Star Margot Robbie Revealed Struggles With Mattel Over Filming The Highly Anticipated Movie",
    "Description": "Margot said that she encouraged Mattel to be involved with the making of the movie. \"In that very first meeting, we impressed upon Ynon [Kreiz, Mattel CEO] we are going to honor the legacy of your brand, but if we don’t acknowledge certain things — if we don’t say it, someone else is going to say it,” she said. “So you might as well be a part of that conversation.”"
  },
  {
    "Title": "Here Are 17 Photos Of The Malibu Barbie DreamHouse That'll Make You Want To Book A Stay ASAP",
    "Description": "Get your Kenergy on at Airbnb's Malibu Barbie DreamHouse."
  },
  {
    "Title": "Just 14 Hilarious Tweets About “Oppenheimer” And “Barbie” Opening On The Same Day",
    "Description": "July 21 can't come soon enough for fans of Barbie and Oppenheimer."
  },
  {
    "Title": "Margot Robbie Talked About How Many Takes It Took To Pull Off That Barbie Tiptoes Moment From The Trailer",
    "Description": "The attention to detail in Greta Gerwig's Barbie is so flawless."
  },
  {
    "Title": "Xbox Have Unveiled A \"Barbie\"-Inspired Console Design And I Need It This Very Instant",
    "Description": "[In the tune of \"Barbie Girl\" by Aqua]: Come on gamers, let's go party (ah, ah, ah, yeah)."
  },
  {
    "Title": "Guess If These Are Real Barbie Movie Titles To See If You're A Barbie Aficionado Or A Plastic Poser",
    "Description": "Let's see if you're REALLY in a Barbie world."
  }
]